{"class_name": "Model", "backend": "tensorflow", "keras_version": "2.1.4-tf", "config": {"input_layers": [["X", 0, 0], ["X_action_mask", 0, 0]], "layers": [{"class_name": "InputLayer", "name": "X", "inbound_nodes": [], "config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 4, 4, 1], "name": "X"}}, {"class_name": "Flatten", "name": "flatten2", "inbound_nodes": [[["X", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "name": "flatten2"}}, {"class_name": "Dense", "name": "fc4", "inbound_nodes": [[["flatten2", 0, 0, {}]]], "config": {"use_bias": true, "trainable": true, "bias_constraint": null, "name": "fc4", "kernel_regularizer": null, "units": 64, "kernel_constraint": null, "activity_regularizer": null, "dtype": "float32", "bias_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "dtype": "float32", "scale": 1.0, "distribution": "uniform", "seed": null}}}}, {"class_name": "InputLayer", "name": "X_action_mask", "inbound_nodes": [], "config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 4], "name": "X_action_mask"}}, {"class_name": "Dense", "name": "fc5", "inbound_nodes": [[["fc4", 0, 0, {}]]], "config": {"use_bias": true, "trainable": true, "bias_constraint": null, "name": "fc5", "kernel_regularizer": null, "units": 4, "kernel_constraint": null, "activity_regularizer": null, "dtype": "float32", "bias_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "dtype": "float32", "scale": 1.0, "distribution": "uniform", "seed": null}}}}, {"class_name": "Multiply", "name": "output", "inbound_nodes": [[["X_action_mask", 0, 0, {}], ["fc5", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "name": "output"}}], "name": "q_network", "output_layers": [["output", 0, 0]]}}