{"class_name": "Model", "config": {"name": "q_network", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 4, 4, 1], "sparse": false, "dtype": "float32", "name": "X"}, "name": "X", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "dtype": "float32", "dilation_rate": [1, 1], "kernel_constraint": null, "activation": "relu", "name": "conv1", "bias_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "trainable": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "dtype": "float32", "distribution": "uniform", "scale": 1.0, "seed": null}}, "filters": 16, "padding": "same", "strides": [1, 1], "bias_constraint": null, "data_format": "channels_last"}, "name": "conv1", "inbound_nodes": [[["X", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"dtype": "float32", "pool_size": [2, 2], "name": "maxpool1", "padding": "same", "strides": [1, 1], "trainable": true, "data_format": "channels_last"}, "name": "maxpool1", "inbound_nodes": [[["conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "dtype": "float32", "dilation_rate": [1, 1], "kernel_constraint": null, "activation": "relu", "name": "conv2", "bias_regularizer": null, "kernel_size": [2, 2], "use_bias": true, "trainable": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "dtype": "float32", "distribution": "uniform", "scale": 1.0, "seed": null}}, "filters": 32, "padding": "same", "strides": [1, 1], "bias_constraint": null, "data_format": "channels_last"}, "name": "conv2", "inbound_nodes": [[["maxpool1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"dtype": "float32", "pool_size": [2, 2], "name": "maxpool2", "padding": "valid", "strides": [1, 1], "trainable": true, "data_format": "channels_last"}, "name": "maxpool2", "inbound_nodes": [[["conv2", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"dtype": "float32", "name": "flatten2", "trainable": true}, "name": "flatten2", "inbound_nodes": [[["maxpool2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "dtype": "float32", "kernel_constraint": null, "trainable": true, "activation": "relu", "name": "fc3", "bias_regularizer": null, "units": 72, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "dtype": "float32", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_constraint": null}, "name": "fc3", "inbound_nodes": [[["flatten2", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"dtype": "float32", "noise_shape": null, "rate": 0.5, "seed": null, "trainable": true, "name": "dropout3"}, "name": "dropout3", "inbound_nodes": [[["fc3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"dtype": "float32", "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "batchnorm3", "gamma_constraint": null, "center": true, "axis": [1], "trainable": true, "epsilon": 0.001, "momentum": 0.99, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_constraint": null}, "name": "batchnorm3", "inbound_nodes": [[["dropout3", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "dtype": "float32", "kernel_constraint": null, "trainable": true, "activation": "relu", "name": "fc4", "bias_regularizer": null, "units": 36, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "dtype": "float32", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_constraint": null}, "name": "fc4", "inbound_nodes": [[["batchnorm3", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"dtype": "float32", "noise_shape": null, "rate": 0.5, "seed": null, "trainable": true, "name": "dropout4"}, "name": "dropout4", "inbound_nodes": [[["fc4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"dtype": "float32", "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "batchnorm4", "gamma_constraint": null, "center": true, "axis": [1], "trainable": true, "epsilon": 0.001, "momentum": 0.99, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_constraint": null}, "name": "batchnorm4", "inbound_nodes": [[["dropout4", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 4], "sparse": false, "dtype": "float32", "name": "X_action_mask"}, "name": "X_action_mask", "inbound_nodes": []}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "dtype": "float32", "kernel_constraint": null, "trainable": true, "activation": "linear", "name": "fc5", "bias_regularizer": null, "units": 4, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "dtype": "float32", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_constraint": null}, "name": "fc5", "inbound_nodes": [[["batchnorm4", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"dtype": "float32", "name": "output", "trainable": true}, "name": "output", "inbound_nodes": [[["X_action_mask", 0, 0, {}], ["fc5", 0, 0, {}]]]}], "input_layers": [["X", 0, 0], ["X_action_mask", 0, 0]], "output_layers": [["output", 0, 0]]}, "backend": "tensorflow", "keras_version": "2.1.4-tf"}