{"config": {"input_layers": [["X", 0, 0], ["X_action_mask", 0, 0]], "output_layers": [["output", 0, 0]], "name": "q_network", "layers": [{"config": {"dtype": "float32", "sparse": false, "name": "X", "batch_input_shape": [null, 4, 4, 1]}, "name": "X", "inbound_nodes": [], "class_name": "InputLayer"}, {"config": {"filters": 16, "activation": "relu", "kernel_constraint": null, "dtype": "float32", "kernel_size": [3, 3], "kernel_initializer": {"config": {"dtype": "float32", "seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "use_bias": true, "trainable": true, "data_format": "channels_last", "strides": [1, 1], "bias_constraint": null, "padding": "same", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_regularizer": null, "name": "conv1", "dilation_rate": [1, 1]}, "name": "conv1", "inbound_nodes": [[["X", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "dtype": "float32", "name": "maxpool1", "pool_size": [2, 2], "padding": "same", "strides": [1, 1], "trainable": true}, "name": "maxpool1", "inbound_nodes": [[["conv1", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"config": {"filters": 32, "activation": "relu", "kernel_constraint": null, "dtype": "float32", "kernel_size": [2, 2], "kernel_initializer": {"config": {"dtype": "float32", "seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "use_bias": true, "trainable": true, "data_format": "channels_last", "strides": [1, 1], "bias_constraint": null, "padding": "same", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_regularizer": null, "name": "conv2", "dilation_rate": [1, 1]}, "name": "conv2", "inbound_nodes": [[["maxpool1", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "dtype": "float32", "name": "maxpool2", "pool_size": [2, 2], "padding": "valid", "strides": [1, 1], "trainable": true}, "name": "maxpool2", "inbound_nodes": [[["conv2", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"config": {"dtype": "float32", "name": "flatten2", "trainable": true}, "name": "flatten2", "inbound_nodes": [[["maxpool2", 0, 0, {}]]], "class_name": "Flatten"}, {"config": {"activation": "relu", "kernel_constraint": null, "dtype": "float32", "kernel_initializer": {"config": {"dtype": "float32", "seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "use_bias": true, "trainable": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "units": 72, "name": "fc3"}, "name": "fc3", "inbound_nodes": [[["flatten2", 0, 0, {}]]], "class_name": "Dense"}, {"config": {"rate": 0.5, "dtype": "float32", "name": "dropout3", "noise_shape": null, "seed": null, "trainable": true}, "name": "dropout3", "inbound_nodes": [[["fc3", 0, 0, {}]]], "class_name": "Dropout"}, {"config": {"scale": true, "momentum": 0.99, "axis": [1], "gamma_constraint": null, "dtype": "float32", "epsilon": 0.001, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "center": true, "trainable": true, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "batchnorm3", "beta_constraint": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_regularizer": null, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "gamma_regularizer": null}, "name": "batchnorm3", "inbound_nodes": [[["dropout3", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"config": {"activation": "relu", "kernel_constraint": null, "dtype": "float32", "kernel_initializer": {"config": {"dtype": "float32", "seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "use_bias": true, "trainable": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "units": 36, "name": "fc4"}, "name": "fc4", "inbound_nodes": [[["batchnorm3", 0, 0, {}]]], "class_name": "Dense"}, {"config": {"rate": 0.5, "dtype": "float32", "name": "dropout4", "noise_shape": null, "seed": null, "trainable": true}, "name": "dropout4", "inbound_nodes": [[["fc4", 0, 0, {}]]], "class_name": "Dropout"}, {"config": {"scale": true, "momentum": 0.99, "axis": [1], "gamma_constraint": null, "dtype": "float32", "epsilon": 0.001, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "center": true, "trainable": true, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "batchnorm4", "beta_constraint": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_regularizer": null, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "gamma_regularizer": null}, "name": "batchnorm4", "inbound_nodes": [[["dropout4", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"config": {"dtype": "float32", "sparse": false, "name": "X_action_mask", "batch_input_shape": [null, 4]}, "name": "X_action_mask", "inbound_nodes": [], "class_name": "InputLayer"}, {"config": {"activation": "linear", "kernel_constraint": null, "dtype": "float32", "kernel_initializer": {"config": {"dtype": "float32", "seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "use_bias": true, "trainable": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "units": 4, "name": "fc5"}, "name": "fc5", "inbound_nodes": [[["batchnorm4", 0, 0, {}]]], "class_name": "Dense"}, {"config": {"dtype": "float32", "name": "output", "trainable": true}, "name": "output", "inbound_nodes": [[["X_action_mask", 0, 0, {}], ["fc5", 0, 0, {}]]], "class_name": "Multiply"}]}, "backend": "tensorflow", "keras_version": "2.1.4-tf", "class_name": "Model"}