{"class_name": "Model", "config": {"name": "q_network", "layers": [{"name": "X", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 4, 4, 1], "dtype": "float32", "sparse": false, "name": "X"}, "inbound_nodes": []}, {"name": "conv1", "class_name": "Conv2D", "config": {"name": "conv1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["X", 0, 0, {}]]]}, {"name": "maxpool1", "class_name": "MaxPooling2D", "config": {"name": "maxpool1", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [1, 1], "data_format": "channels_last"}, "inbound_nodes": [[["conv1", 0, 0, {}]]]}, {"name": "flatten2", "class_name": "Flatten", "config": {"name": "flatten2", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["maxpool1", 0, 0, {}]]]}, {"name": "fc4", "class_name": "Dense", "config": {"name": "fc4", "trainable": true, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["flatten2", 0, 0, {}]]]}, {"name": "X_action_mask", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 4], "dtype": "float32", "sparse": false, "name": "X_action_mask"}, "inbound_nodes": []}, {"name": "fc5", "class_name": "Dense", "config": {"name": "fc5", "trainable": true, "dtype": "float32", "units": 4, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["fc4", 0, 0, {}]]]}, {"name": "output", "class_name": "Multiply", "config": {"name": "output", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["X_action_mask", 0, 0, {}], ["fc5", 0, 0, {}]]]}], "input_layers": [["X", 0, 0], ["X_action_mask", 0, 0]], "output_layers": [["output", 0, 0]]}, "keras_version": "2.1.4-tf", "backend": "tensorflow"}