{"class_name": "Model", "backend": "tensorflow", "config": {"name": "q_network", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 4, 4, 1], "name": "X", "dtype": "float32", "sparse": false}, "name": "X", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "dtype": "float32", "bias_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "dtype": "float32", "scale": 1.0}}, "strides": [1, 1], "filters": 32, "activation": "relu", "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_size": [3, 3], "name": "conv1", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "conv1", "inbound_nodes": [[["X", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "dtype": "float32", "padding": "valid", "name": "maxpool1", "trainable": true, "strides": [1, 1], "data_format": "channels_last"}, "name": "maxpool1", "inbound_nodes": [[["conv1", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten2", "trainable": true, "dtype": "float32"}, "name": "flatten2", "inbound_nodes": [[["maxpool1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "dtype": "float32", "scale": 1.0}}, "name": "fc4", "trainable": true, "activation": "relu", "bias_constraint": null, "use_bias": true, "units": 32, "kernel_regularizer": null}, "name": "fc4", "inbound_nodes": [[["flatten2", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 4], "name": "X_action_mask", "dtype": "float32", "sparse": false}, "name": "X_action_mask", "inbound_nodes": []}, {"class_name": "Dense", "config": {"kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "dtype": "float32", "scale": 1.0}}, "name": "fc5", "trainable": true, "activation": "linear", "bias_constraint": null, "use_bias": true, "units": 4, "kernel_regularizer": null}, "name": "fc5", "inbound_nodes": [[["fc4", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "output", "trainable": true, "dtype": "float32"}, "name": "output", "inbound_nodes": [[["X_action_mask", 0, 0, {}], ["fc5", 0, 0, {}]]]}], "input_layers": [["X", 0, 0], ["X_action_mask", 0, 0]], "output_layers": [["output", 0, 0]]}, "keras_version": "2.1.4-tf"}