{"class_name": "Model", "config": {"name": "q_network", "layers": [{"class_name": "InputLayer", "name": "X", "inbound_nodes": [], "config": {"sparse": false, "batch_input_shape": [null, 4, 4, 1], "dtype": "float32", "name": "X"}}, {"class_name": "Conv2D", "name": "conv1", "inbound_nodes": [[["X", 0, 0, {}]]], "config": {"strides": [1, 1], "activity_regularizer": null, "trainable": true, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_constraint": null, "dtype": "float32", "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "dtype": "float32", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "name": "conv1", "filters": 32, "padding": "same", "activation": "relu"}}, {"class_name": "MaxPooling2D", "name": "maxpool1", "inbound_nodes": [[["conv1", 0, 0, {}]]], "config": {"strides": [1, 1], "trainable": true, "pool_size": [2, 2], "name": "maxpool1", "dtype": "float32", "padding": "valid", "data_format": "channels_last"}}, {"class_name": "Flatten", "name": "flatten2", "inbound_nodes": [[["maxpool1", 0, 0, {}]]], "config": {"name": "flatten2", "trainable": true, "dtype": "float32"}}, {"class_name": "Dense", "name": "fc4", "inbound_nodes": [[["flatten2", 0, 0, {}]]], "config": {"activity_regularizer": null, "trainable": true, "activation": "relu", "kernel_constraint": null, "dtype": "float32", "use_bias": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "dtype": "float32", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "name": "fc4", "units": 32, "bias_constraint": null}}, {"class_name": "InputLayer", "name": "X_action_mask", "inbound_nodes": [], "config": {"sparse": false, "batch_input_shape": [null, 4], "dtype": "float32", "name": "X_action_mask"}}, {"class_name": "Dense", "name": "fc5", "inbound_nodes": [[["fc4", 0, 0, {}]]], "config": {"activity_regularizer": null, "trainable": true, "activation": "linear", "kernel_constraint": null, "dtype": "float32", "use_bias": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "dtype": "float32", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "name": "fc5", "units": 4, "bias_constraint": null}}, {"class_name": "Multiply", "name": "output", "inbound_nodes": [[["X_action_mask", 0, 0, {}], ["fc5", 0, 0, {}]]], "config": {"name": "output", "trainable": true, "dtype": "float32"}}], "input_layers": [["X", 0, 0], ["X_action_mask", 0, 0]], "output_layers": [["output", 0, 0]]}, "keras_version": "2.1.4-tf", "backend": "tensorflow"}