{"backend": "tensorflow", "class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 4, 4, 1], "dtype": "float32", "name": "X", "sparse": false}, "name": "X", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "filters": 16, "dtype": "float32", "name": "conv1", "bias_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "dtype": "float32"}}, "activity_regularizer": null, "trainable": true, "padding": "same", "kernel_size": [3, 3], "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "kernel_constraint": null, "data_format": "channels_last", "kernel_regularizer": null}, "name": "conv1", "inbound_nodes": [[["X", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "dtype": "float32", "name": "maxpool1", "strides": [1, 1], "pool_size": [2, 2], "data_format": "channels_last", "padding": "same"}, "name": "maxpool1", "inbound_nodes": [[["conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "filters": 32, "dtype": "float32", "name": "conv2", "bias_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "dtype": "float32"}}, "activity_regularizer": null, "trainable": true, "padding": "same", "kernel_size": [2, 2], "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "kernel_constraint": null, "data_format": "channels_last", "kernel_regularizer": null}, "name": "conv2", "inbound_nodes": [[["maxpool1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "dtype": "float32", "name": "maxpool2", "strides": [1, 1], "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid"}, "name": "maxpool2", "inbound_nodes": [[["conv2", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"trainable": true, "dtype": "float32", "name": "flatten2"}, "name": "flatten2", "inbound_nodes": [[["maxpool2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"bias_constraint": null, "dtype": "float32", "name": "fc3", "bias_regularizer": null, "units": 72, "activation": "relu", "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "dtype": "float32"}}}, "name": "fc3", "inbound_nodes": [[["flatten2", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"seed": null, "noise_shape": null, "trainable": true, "dtype": "float32", "name": "dropout3", "rate": 0.5}, "name": "dropout3", "inbound_nodes": [[["fc3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "axis": [1], "beta_regularizer": null, "dtype": "float32", "name": "batchnorm3", "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "center": true, "trainable": true, "scale": true}, "name": "batchnorm3", "inbound_nodes": [[["dropout3", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"bias_constraint": null, "dtype": "float32", "name": "fc4", "bias_regularizer": null, "units": 36, "activation": "relu", "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "dtype": "float32"}}}, "name": "fc4", "inbound_nodes": [[["batchnorm3", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"seed": null, "noise_shape": null, "trainable": true, "dtype": "float32", "name": "dropout4", "rate": 0.5}, "name": "dropout4", "inbound_nodes": [[["fc4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "axis": [1], "beta_regularizer": null, "dtype": "float32", "name": "batchnorm4", "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "center": true, "trainable": true, "scale": true}, "name": "batchnorm4", "inbound_nodes": [[["dropout4", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 4], "dtype": "float32", "name": "X_action_mask", "sparse": false}, "name": "X_action_mask", "inbound_nodes": []}, {"class_name": "Dense", "config": {"bias_constraint": null, "dtype": "float32", "name": "fc5", "bias_regularizer": null, "units": 4, "activation": "linear", "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "dtype": "float32"}}}, "name": "fc5", "inbound_nodes": [[["batchnorm4", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"trainable": true, "dtype": "float32", "name": "output"}, "name": "output", "inbound_nodes": [[["X_action_mask", 0, 0, {}], ["fc5", 0, 0, {}]]]}], "input_layers": [["X", 0, 0], ["X_action_mask", 0, 0]], "name": "q_network", "output_layers": [["output", 0, 0]]}, "keras_version": "2.1.4-tf"}