{"config": {"input_layers": [["X", 0, 0], ["X_action_mask", 0, 0]], "name": "q_network", "layers": [{"config": {"batch_input_shape": [null, 4, 4, 1], "dtype": "float32", "name": "X", "sparse": false}, "class_name": "InputLayer", "name": "X", "inbound_nodes": []}, {"config": {"dtype": "float32", "name": "flatten2", "trainable": true}, "class_name": "Flatten", "name": "flatten2", "inbound_nodes": [[["X", 0, 0, {}]]]}, {"config": {"kernel_initializer": {"config": {"dtype": "float32", "scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "fc4", "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "units": 64, "activation": "relu", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "dtype": "float32"}, "class_name": "Dense", "name": "fc4", "inbound_nodes": [[["flatten2", 0, 0, {}]]]}, {"config": {"batch_input_shape": [null, 4], "dtype": "float32", "name": "X_action_mask", "sparse": false}, "class_name": "InputLayer", "name": "X_action_mask", "inbound_nodes": []}, {"config": {"kernel_initializer": {"config": {"dtype": "float32", "scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "fc5", "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "units": 4, "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "dtype": "float32"}, "class_name": "Dense", "name": "fc5", "inbound_nodes": [[["fc4", 0, 0, {}]]]}, {"config": {"dtype": "float32", "name": "output", "trainable": true}, "class_name": "Multiply", "name": "output", "inbound_nodes": [[["X_action_mask", 0, 0, {}], ["fc5", 0, 0, {}]]]}], "output_layers": [["output", 0, 0]]}, "keras_version": "2.1.4-tf", "class_name": "Model", "backend": "tensorflow"}