{"class_name": "Model", "keras_version": "2.1.4-tf", "config": {"name": "q_network", "input_layers": [["X", 0, 0], ["X_action_mask", 0, 0]], "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "X", "config": {"name": "X", "batch_input_shape": [null, 4, 4, 1], "dtype": "float32", "sparse": false}}, {"inbound_nodes": [[["X", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv1", "config": {"padding": "same", "strides": [1, 1], "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "dtype": "float32", "scale": 1.0}}, "activation": "relu", "kernel_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null, "dtype": "float32", "bias_constraint": null, "name": "conv1", "filters": 32, "trainable": true}}, {"inbound_nodes": [[["conv1", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "maxpool1", "config": {"padding": "valid", "strides": [1, 1], "dtype": "float32", "data_format": "channels_last", "name": "maxpool1", "pool_size": [2, 2], "trainable": true}}, {"inbound_nodes": [[["maxpool1", 0, 0, {}]]], "class_name": "Flatten", "name": "flatten2", "config": {"name": "flatten2", "trainable": true, "dtype": "float32"}}, {"inbound_nodes": [[["flatten2", 0, 0, {}]]], "class_name": "Dense", "name": "fc4", "config": {"bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "dtype": "float32", "scale": 1.0}}, "activation": "relu", "kernel_regularizer": null, "units": 32, "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "dtype": "float32", "bias_constraint": null, "name": "fc4", "trainable": true}}, {"inbound_nodes": [], "class_name": "InputLayer", "name": "X_action_mask", "config": {"name": "X_action_mask", "batch_input_shape": [null, 4], "dtype": "float32", "sparse": false}}, {"inbound_nodes": [[["fc4", 0, 0, {}]]], "class_name": "Dense", "name": "fc5", "config": {"bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "dtype": "float32", "scale": 1.0}}, "activation": "linear", "kernel_regularizer": null, "units": 4, "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "dtype": "float32", "bias_constraint": null, "name": "fc5", "trainable": true}}, {"inbound_nodes": [[["X_action_mask", 0, 0, {}], ["fc5", 0, 0, {}]]], "class_name": "Multiply", "name": "output", "config": {"name": "output", "trainable": true, "dtype": "float32"}}], "output_layers": [["output", 0, 0]]}, "backend": "tensorflow"}