{"config": {"name": "q_network", "output_layers": [["output", 0, 0]], "input_layers": [["X", 0, 0], ["X_action_mask", 0, 0]], "layers": [{"config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 4, 4, 1], "name": "X"}, "inbound_nodes": [], "class_name": "InputLayer", "name": "X"}, {"config": {"trainable": true, "activation": "relu", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_initializer": {"config": {"dtype": "float32", "mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "data_format": "channels_last", "use_bias": true, "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "name": "conv1", "padding": "same", "dtype": "float32", "filters": 32, "bias_constraint": null}, "inbound_nodes": [[["X", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv1"}, {"config": {"trainable": true, "strides": [1, 1], "name": "maxpool1", "data_format": "channels_last", "dtype": "float32", "pool_size": [2, 2], "padding": "valid"}, "inbound_nodes": [[["conv1", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "maxpool1"}, {"config": {"trainable": true, "dtype": "float32", "name": "flatten2"}, "inbound_nodes": [[["maxpool1", 0, 0, {}]]], "class_name": "Flatten", "name": "flatten2"}, {"config": {"trainable": true, "activation": "relu", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_constraint": null, "units": 32, "kernel_initializer": {"config": {"dtype": "float32", "mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "use_bias": true, "name": "fc4", "bias_regularizer": null, "activity_regularizer": null, "dtype": "float32", "bias_constraint": null}, "inbound_nodes": [[["flatten2", 0, 0, {}]]], "class_name": "Dense", "name": "fc4"}, {"config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 4], "name": "X_action_mask"}, "inbound_nodes": [], "class_name": "InputLayer", "name": "X_action_mask"}, {"config": {"trainable": true, "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_constraint": null, "units": 4, "kernel_initializer": {"config": {"dtype": "float32", "mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "use_bias": true, "name": "fc5", "bias_regularizer": null, "activity_regularizer": null, "dtype": "float32", "bias_constraint": null}, "inbound_nodes": [[["fc4", 0, 0, {}]]], "class_name": "Dense", "name": "fc5"}, {"config": {"trainable": true, "dtype": "float32", "name": "output"}, "inbound_nodes": [[["X_action_mask", 0, 0, {}], ["fc5", 0, 0, {}]]], "class_name": "Multiply", "name": "output"}]}, "keras_version": "2.1.4-tf", "class_name": "Model", "backend": "tensorflow"}