{"keras_version": "2.1.4-tf", "config": {"input_layers": [["X", 0, 0], ["X_action_mask", 0, 0]], "name": "q_network", "layers": [{"inbound_nodes": [], "config": {"sparse": false, "dtype": "float32", "name": "X", "batch_input_shape": [null, 4, 4, 1]}, "name": "X", "class_name": "InputLayer"}, {"inbound_nodes": [[["X", 0, 0, {}]]], "config": {"kernel_size": [3, 3], "dtype": "float32", "name": "conv1", "strides": [1, 1], "padding": "same", "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "dtype": "float32", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "kernel_constraint": null, "bias_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "filters": 32, "trainable": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "name": "conv1", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv1", 0, 0, {}]]], "config": {"dtype": "float32", "data_format": "channels_last", "name": "maxpool1", "strides": [1, 1], "pool_size": [2, 2], "padding": "valid", "trainable": true}, "name": "maxpool1", "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["maxpool1", 0, 0, {}]]], "config": {"dtype": "float32", "name": "flatten2", "trainable": true}, "name": "flatten2", "class_name": "Flatten"}, {"inbound_nodes": [[["flatten2", 0, 0, {}]]], "config": {"dtype": "float32", "name": "fc4", "units": 32, "bias_regularizer": null, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "dtype": "float32", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activation": "relu", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_constraint": null}, "name": "fc4", "class_name": "Dense"}, {"inbound_nodes": [], "config": {"sparse": false, "dtype": "float32", "name": "X_action_mask", "batch_input_shape": [null, 4]}, "name": "X_action_mask", "class_name": "InputLayer"}, {"inbound_nodes": [[["fc4", 0, 0, {}]]], "config": {"dtype": "float32", "name": "fc5", "units": 4, "bias_regularizer": null, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "dtype": "float32", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_constraint": null}, "name": "fc5", "class_name": "Dense"}, {"inbound_nodes": [[["X_action_mask", 0, 0, {}], ["fc5", 0, 0, {}]]], "config": {"dtype": "float32", "name": "output", "trainable": true}, "name": "output", "class_name": "Multiply"}], "output_layers": [["output", 0, 0]]}, "class_name": "Model", "backend": "tensorflow"}