{"backend": "tensorflow", "class_name": "Model", "config": {"output_layers": [["output", 0, 0]], "name": "q_network", "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "config": {"batch_input_shape": [null, 4, 4, 1], "dtype": "float32", "name": "X", "sparse": false}, "name": "X"}, {"inbound_nodes": [[["X", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "dtype": "float32", "distribution": "uniform", "scale": 1.0, "seed": null}}, "trainable": true, "padding": "same", "data_format": "channels_last", "filters": 32, "activation": "relu", "bias_regularizer": null, "name": "conv1", "use_bias": true, "strides": [1, 1], "dtype": "float32", "bias_constraint": null, "kernel_constraint": null}, "name": "conv1"}, {"inbound_nodes": [[["conv1", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "pool_size": [2, 2], "dtype": "float32", "name": "maxpool1", "strides": [1, 1], "trainable": true, "padding": "valid"}, "name": "maxpool1"}, {"inbound_nodes": [[["maxpool1", 0, 0, {}]]], "class_name": "Flatten", "config": {"dtype": "float32", "name": "flatten2", "trainable": true}, "name": "flatten2"}, {"inbound_nodes": [[["flatten2", 0, 0, {}]]], "class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "dtype": "float32", "distribution": "uniform", "scale": 1.0, "seed": null}}, "trainable": true, "bias_constraint": null, "units": 32, "activation": "relu", "bias_regularizer": null, "name": "fc4", "use_bias": true, "dtype": "float32", "activity_regularizer": null, "kernel_constraint": null}, "name": "fc4"}, {"inbound_nodes": [], "class_name": "InputLayer", "config": {"batch_input_shape": [null, 4], "dtype": "float32", "name": "X_action_mask", "sparse": false}, "name": "X_action_mask"}, {"inbound_nodes": [[["fc4", 0, 0, {}]]], "class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "dtype": "float32", "distribution": "uniform", "scale": 1.0, "seed": null}}, "trainable": true, "bias_constraint": null, "units": 4, "activation": "tanh", "bias_regularizer": null, "name": "fc5", "use_bias": true, "dtype": "float32", "activity_regularizer": null, "kernel_constraint": null}, "name": "fc5"}, {"inbound_nodes": [[["X_action_mask", 0, 0, {}], ["fc5", 0, 0, {}]]], "class_name": "Multiply", "config": {"dtype": "float32", "name": "output", "trainable": true}, "name": "output"}], "input_layers": [["X", 0, 0], ["X_action_mask", 0, 0]]}, "keras_version": "2.1.4-tf"}